In [87]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series(["하나", "둘", "셋", "넷", "다섯",
                    "여섯", "일곱", "여덟", "아홉", "열"],
                   index=[_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [ ]:
Series 생성 : 첫 인수로 data 두번째 인수로는 index(data와length가 동일해야됨)

In [3]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
x = pd.Series([10,20,30,40,50,60,70,80,90],
              index=[_ for _ in range(9)])
x

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [8]:
x = pd.Series(list(range(10,100,10)))
x

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [9]:
#index를 지정하지 않고 Series 만들기
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [10]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [11]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [14]:
len(x[x>50])

4

In [16]:
sum(x.values>50)

4

In [17]:
s.index.name = '도시'
s.name = '인구'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [27]:
# Series 객체를 만들 때 data에 dict를 사용해서 만들기
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [19]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['x', 'y', 'z'])
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [20]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [22]:
s2 = pd.Series({"서울":9_904_312,
                "부산":3_448_737,
                "인천":2_890_451,
                "대구":2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [23]:
x = pd.Series({"철수":88, "영희":95, "길동":100, "몽룡":67})
x

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [25]:
# 다른 방법
x = pd.Series([88,95,100,67],
              index=["철수", "영희", "길동", "몽룡"])
x

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [28]:
ser.a, ser.b, ser.c

(1, 2, 3)

In [29]:
# Series의 특징 : in연산도 가능, items()메서드를 사용하여 for문 루프를 돌려 각 요소의 키와 벨류에 접근 가능
"서울" in s

True

In [30]:
"대전"in s

False

In [32]:
for k,v in s.items():
    print(f"{k}, {v}")

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [34]:
for k,v in s.items():
    if v > 3000000:
        print(f"{k}의 인구는 300만이 넘습니다.")

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [35]:
s / 1000000

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

In [36]:
# Series에서 인덱시도 가능하고, 슬라이싱도 가능
s[1], s["부산"]

(3448737, 3448737)

In [37]:
s[3],s["대구"]

(2466052, 2466052)

In [38]:
s[[0,3,1]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [39]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [40]:
s[["서울","대구","부산"]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [41]:
s[[0]]

서울    9904312
dtype: int64

In [42]:
s[[2]]

인천    2890451
dtype: int64

In [43]:
s[1:3]

부산    3448737
인천    2890451
dtype: int64

In [44]:
s[1:]

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [45]:
s2 = pd.Series({"서울":9631482,"부산":3393191,"인천":2632035,"대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [47]:
ds = s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
ds.isnull() # Null인 값이 존재하면 true

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [49]:
ds.notnull()   # Null인 값이 아닌 것이 true

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [50]:
rs = (s-s2)/s2*100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [54]:
ds = s-s2
ds = ds[ds.notnull()]
ds[[ds.argmax()]]

서울    272830.0
dtype: float64

In [56]:
# Series 데이터 추가, 갱신 , 삭제
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [57]:
rs["서울","인천"] = (2.83,9.82)

In [58]:
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [59]:
del rs["서울"]

In [60]:
rs

부산    1.63
인천    9.82
dtype: float64

In [62]:
fin1 = {"카카오":60010, "삼성전자":61000, "LG전자": 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ["카카오", "삼성전자", "네이버"]

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, fin2_index)
ser_finance1, ser_finance2

(카카오     60010
 삼성전자    61000
 LG전자    90000
 dtype: int64,
 카카오      60200
 삼성전자     61200
 네이버     200100
 dtype: int64)

In [64]:
s = ser_finance1      # NaN값이 있으면 float 형식으로 바뀐다 float형식에서는 NaN값이 표현이 됨
s2 = ser_finance2
print(s-s2)
print(s+s2)
print(s*s2)
print(s/s2)

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64
LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [69]:
result = s-s2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [70]:
# DataFrame 생성

d = {'col1': [1,2], 'col2': [3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [71]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [72]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [73]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [74]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [78]:
df.index.name = "도시"
df.columns.name ="특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [114]:
data = {
    "확진자" : [105_396_817,44_688_101,39_638_159,38-210_850,30_569_215],
    "사망자" : [1_146_740,530_775,165_030,168_397,34_034],
    "완치" : [102_864_696,44_154_425,39_400_459,37_767_300,969_524],
    "치명(%)" : [1.1,1.2,0.4,0.4,0.1],
    "완치(%)" : [97.6,98.8,99.4,98.8,3.2],
    "발생률*" : [318_417,32_383,607_263,456_064,596_249],
    "국가" : ["","","","",""]
}
columns = ["국가","확진자","사망자","완치","치명(%)","완치(%)","발생률*"]
index = ["미국","인도","프랑스","독일","한국"]
df = pd.DataFrame(data, index, columns)
df

    국가        확진자      사망자         완치  치명(%)  완치(%)    발생률*
미국      105396817  1146740  102864696    1.1   97.6  318417
인도       44688101   530775   44154425    1.2   98.8   32383
프랑스      39638159   165030   39400459    0.4   99.4  607263
독일        -210812   168397   37767300    0.4   98.8  456064
한국       30569215    34034     969524    0.1    3.2  596249

In [77]:
# transpose(T) 전치를 포함하여 넘파이 2차열 배열이 가지는 대부분의 속성이나 메서드 지원

df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [79]:
#DataFrame 생성, 추가, 삭제

#2010-2015 증가율"이라는 이름의 열의 값을 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [80]:
#"2005-2010 증가율"이라는 이름의 column을 추가
df["2005-2010 증가율"] = ((df["2010"]-df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [81]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [82]:
df["지역"] # 하나의 column만 넣으면 Series 객체가 반환된다

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [83]:
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [84]:
# 배열 또는 리스트로 인덱싱하면 DataFrame 타입이 반환된다

df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [85]:
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [ ]:
DataFrame의 index가 문자열 때는 정수 index를 column인덱싱에 사용할 수 없다.

In [88]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [89]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [90]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [91]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [93]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [94]:
df[:"서울"]  # 문자는 포함됨

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [95]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [96]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [97]:
df["2015"]["서울"]

9904312

In [99]:
data = {
 "국어": [80, 90, 70, 30],
 "영어": [90, 70, 60, 40],
 "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [100]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [101]:
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [102]:
df["평균 점수"] = ((df["국어"]+df["영어"]+df["수학"])/3).round(2)
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [108]:
df.T["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [109]:
df[:1]

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [110]:
np.random.seed(0)
values = np.random.randn(6,4)
index = pd.date_range("20130226", periods=6)

x = pd.DataFrame(values, index, columns=["A","B","C","D"])
x

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165